Revit 2026 API

# CancellationListener Methods

---

The CancellationListener type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Returns true if the operation associated with this instance has been cancelled. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

CancellationListener Class

Autodesk.Revit.DB Namespace